luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxOvc_reg.h
/** \brief  114, Overlay Mask Register */
#define OVC0_BLK21_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC14u)

/** Alias (User Manual Name) for OVC0_BLK21_OMASK.
* To use register names with standard convension, please use OVC0_BLK21_OMASK.
*/
#define	OVC0_OMASK21	(OVC0_BLK21_OMASK)

/** \brief  110, Overlay Target Address Register */
#define OVC0_BLK21_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC10u)

/** Alias (User Manual Name) for OVC0_BLK21_OTAR.
* To use register names with standard convension, please use OVC0_BLK21_OTAR.
*/
#define	OVC0_OTAR21	(OVC0_BLK21_OTAR)

/** \brief  10C, Redirected Address Base Register */
#define OVC0_BLK21_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FC0Cu)

/** Alias (User Manual Name) for OVC0_BLK21_RABR.
* To use register names with standard convension, please use OVC0_BLK21_RABR.
*/
#define	OVC0_RABR21	(OVC0_BLK21_RABR)

/** \brief  120, Overlay Mask Register */
#define OVC0_BLK22_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC20u)

/** Alias (User Manual Name) for OVC0_BLK22_OMASK.
* To use register names with standard convension, please use OVC0_BLK22_OMASK.
*/
#define	OVC0_OMASK22	(OVC0_BLK22_OMASK)

/** \brief  11C, Overlay Target Address Register */
#define OVC0_BLK22_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC1Cu)

/** Alias (User Manual Name) for OVC0_BLK22_OTAR.
* To use register names with standard convension, please use OVC0_BLK22_OTAR.
*/
#define	OVC0_OTAR22	(OVC0_BLK22_OTAR)

/** \brief  118, Redirected Address Base Register */
#define OVC0_BLK22_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FC18u)

/** Alias (User Manual Name) for OVC0_BLK22_RABR.
* To use register names with standard convension, please use OVC0_BLK22_RABR.
*/
#define	OVC0_RABR22	(OVC0_BLK22_RABR)

/** \brief  12C, Overlay Mask Register */
#define OVC0_BLK23_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC2Cu)

/** Alias (User Manual Name) for OVC0_BLK23_OMASK.
* To use register names with standard convension, please use OVC0_BLK23_OMASK.
*/
#define	OVC0_OMASK23	(OVC0_BLK23_OMASK)

/** \brief  128, Overlay Target Address Register */
#define OVC0_BLK23_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC28u)

/** Alias (User Manual Name) for OVC0_BLK23_OTAR.
* To use register names with standard convension, please use OVC0_BLK23_OTAR.
*/
#define	OVC0_OTAR23	(OVC0_BLK23_OTAR)

/** \brief  124, Redirected Address Base Register */
#define OVC0_BLK23_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FC24u)

/** Alias (User Manual Name) for OVC0_BLK23_RABR.
* To use register names with standard convension, please use OVC0_BLK23_RABR.
*/
#define	OVC0_RABR23	(OVC0_BLK23_RABR)

/** \brief  138, Overlay Mask Register */
#define OVC0_BLK24_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC38u)

/** Alias (User Manual Name) for OVC0_BLK24_OMASK.
* To use register names with standard convension, please use OVC0_BLK24_OMASK.
*/
#define	OVC0_OMASK24	(OVC0_BLK24_OMASK)

/** \brief  134, Overlay Target Address Register */
#define OVC0_BLK24_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC34u)

/** Alias (User Manual Name) for OVC0_BLK24_OTAR.
* To use register names with standard convension, please use OVC0_BLK24_OTAR.
*/
#define	OVC0_OTAR24	(OVC0_BLK24_OTAR)

/** \brief  130, Redirected Address Base Register */
#define OVC0_BLK24_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FC30u)

/** Alias (User Manual Name) for OVC0_BLK24_RABR.
* To use register names with standard convension, please use OVC0_BLK24_RABR.
*/
#define	OVC0_RABR24	(OVC0_BLK24_RABR)

/** \brief  144, Overlay Mask Register */
#define OVC0_BLK25_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC44u)

/** Alias (User Manual Name) for OVC0_BLK25_OMASK.
* To use register names with standard convension, please use OVC0_BLK25_OMASK.
*/
#define	OVC0_OMASK25	(OVC0_BLK25_OMASK)

/** \brief  140, Overlay Target Address Register */
#define OVC0_BLK25_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC40u)

/** Alias (User Manual Name) for OVC0_BLK25_OTAR.
* To use register names with standard convension, please use OVC0_BLK25_OTAR.
*/
#define	OVC0_OTAR25	(OVC0_BLK25_OTAR)

/** \brief  13C, Redirected Address Base Register */
#define OVC0_BLK25_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FC3Cu)

/** Alias (User Manual Name) for OVC0_BLK25_RABR.
* To use register names with standard convension, please use OVC0_BLK25_RABR.
*/
#define	OVC0_RABR25	(OVC0_BLK25_RABR)

/** \brief  150, Overlay Mask Register */
#define OVC0_BLK26_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC50u)

/** Alias (User Manual Name) for OVC0_BLK26_OMASK.
* To use register names with standard convension, please use OVC0_BLK26_OMASK.
*/
#define	OVC0_OMASK26	(OVC0_BLK26_OMASK)

/** \brief  14C, Overlay Target Address Register */
#define OVC0_BLK26_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC4Cu)

/** Alias (User Manual Name) for OVC0_BLK26_OTAR.
* To use register names with standard convension, please use OVC0_BLK26_OTAR.
*/
#define	OVC0_OTAR26	(OVC0_BLK26_OTAR)

/** \brief  148, Redirected Address Base Register */
#define OVC0_BLK26_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FC48u)

/** Alias (User Manual Name) for OVC0_BLK26_RABR.
* To use register names with standard convension, please use OVC0_BLK26_RABR.
*/
#define	OVC0_RABR26	(OVC0_BLK26_RABR)

/** \brief  15C, Overlay Mask Register */
#define OVC0_BLK27_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC5Cu)

/** Alias (User Manual Name) for OVC0_BLK27_OMASK.
* To use register names with standard convension, please use OVC0_BLK27_OMASK.
*/
#define	OVC0_OMASK27	(OVC0_BLK27_OMASK)

/** \brief  158, Overlay Target Address Register */
#define OVC0_BLK27_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC58u)

/** Alias (User Manual Name) for OVC0_BLK27_OTAR.
* To use register names with standard convension, please use OVC0_BLK27_OTAR.
*/
#define	OVC0_OTAR27	(OVC0_BLK27_OTAR)

