luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxOvc_reg.h
/** \brief  54, Overlay Mask Register */
#define OVC0_BLK5_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FB54u)

/** Alias (User Manual Name) for OVC0_BLK5_OMASK.
* To use register names with standard convension, please use OVC0_BLK5_OMASK.
*/
#define	OVC0_OMASK5	(OVC0_BLK5_OMASK)

/** \brief  50, Overlay Target Address Register */
#define OVC0_BLK5_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FB50u)

/** Alias (User Manual Name) for OVC0_BLK5_OTAR.
* To use register names with standard convension, please use OVC0_BLK5_OTAR.
*/
#define	OVC0_OTAR5	(OVC0_BLK5_OTAR)

/** \brief  4C, Redirected Address Base Register */
#define OVC0_BLK5_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FB4Cu)

/** Alias (User Manual Name) for OVC0_BLK5_RABR.
* To use register names with standard convension, please use OVC0_BLK5_RABR.
*/
#define	OVC0_RABR5	(OVC0_BLK5_RABR)

/** \brief  60, Overlay Mask Register */
#define OVC0_BLK6_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FB60u)

/** Alias (User Manual Name) for OVC0_BLK6_OMASK.
* To use register names with standard convension, please use OVC0_BLK6_OMASK.
*/
#define	OVC0_OMASK6	(OVC0_BLK6_OMASK)

/** \brief  5C, Overlay Target Address Register */
#define OVC0_BLK6_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FB5Cu)

/** Alias (User Manual Name) for OVC0_BLK6_OTAR.
* To use register names with standard convension, please use OVC0_BLK6_OTAR.
*/
#define	OVC0_OTAR6	(OVC0_BLK6_OTAR)

/** \brief  58, Redirected Address Base Register */
#define OVC0_BLK6_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FB58u)

/** Alias (User Manual Name) for OVC0_BLK6_RABR.
* To use register names with standard convension, please use OVC0_BLK6_RABR.
*/
#define	OVC0_RABR6	(OVC0_BLK6_RABR)

/** \brief  6C, Overlay Mask Register */
#define OVC0_BLK7_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FB6Cu)

/** Alias (User Manual Name) for OVC0_BLK7_OMASK.
* To use register names with standard convension, please use OVC0_BLK7_OMASK.
*/
#define	OVC0_OMASK7	(OVC0_BLK7_OMASK)

/** \brief  68, Overlay Target Address Register */
#define OVC0_BLK7_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FB68u)

/** Alias (User Manual Name) for OVC0_BLK7_OTAR.
* To use register names with standard convension, please use OVC0_BLK7_OTAR.
*/
#define	OVC0_OTAR7	(OVC0_BLK7_OTAR)

/** \brief  64, Redirected Address Base Register */
#define OVC0_BLK7_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FB64u)

/** Alias (User Manual Name) for OVC0_BLK7_RABR.
* To use register names with standard convension, please use OVC0_BLK7_RABR.
*/
#define	OVC0_RABR7	(OVC0_BLK7_RABR)

/** \brief  78, Overlay Mask Register */
#define OVC0_BLK8_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FB78u)

/** Alias (User Manual Name) for OVC0_BLK8_OMASK.
* To use register names with standard convension, please use OVC0_BLK8_OMASK.
*/
#define	OVC0_OMASK8	(OVC0_BLK8_OMASK)

/** \brief  74, Overlay Target Address Register */
#define OVC0_BLK8_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FB74u)

/** Alias (User Manual Name) for OVC0_BLK8_OTAR.
* To use register names with standard convension, please use OVC0_BLK8_OTAR.
*/
#define	OVC0_OTAR8	(OVC0_BLK8_OTAR)

/** \brief  70, Redirected Address Base Register */
#define OVC0_BLK8_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FB70u)

/** Alias (User Manual Name) for OVC0_BLK8_RABR.
* To use register names with standard convension, please use OVC0_BLK8_RABR.
*/
#define	OVC0_RABR8	(OVC0_BLK8_RABR)

/** \brief  84, Overlay Mask Register */
#define OVC0_BLK9_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FB84u)

/** Alias (User Manual Name) for OVC0_BLK9_OMASK.
* To use register names with standard convension, please use OVC0_BLK9_OMASK.
*/
#define	OVC0_OMASK9	(OVC0_BLK9_OMASK)

/** \brief  80, Overlay Target Address Register */
#define OVC0_BLK9_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FB80u)

/** Alias (User Manual Name) for OVC0_BLK9_OTAR.
* To use register names with standard convension, please use OVC0_BLK9_OTAR.
*/
#define	OVC0_OTAR9	(OVC0_BLK9_OTAR)

/** \brief  7C, Redirected Address Base Register */
#define OVC0_BLK9_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FB7Cu)

/** Alias (User Manual Name) for OVC0_BLK9_RABR.
* To use register names with standard convension, please use OVC0_BLK9_RABR.
*/
#define	OVC0_RABR9	(OVC0_BLK9_RABR)

/** \brief  0, Overlay Range Select Register */
#define OVC0_OSEL /*lint --e(923)*/ (*(volatile Ifx_OVC_OSEL*)0xF880FB00u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ovc_Cfg_Ovc1
 * \{  */

/** \brief  18, Overlay Mask Register */
#define OVC1_BLK0_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB18u)

/** Alias (User Manual Name) for OVC1_BLK0_OMASK.
* To use register names with standard convension, please use OVC1_BLK0_OMASK.
*/
#define	OVC1_OMASK0	(OVC1_BLK0_OMASK)

/** \brief  14, Overlay Target Address Register */
#define OVC1_BLK0_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB14u)

/** Alias (User Manual Name) for OVC1_BLK0_OTAR.
* To use register names with standard convension, please use OVC1_BLK0_OTAR.
*/
#define	OVC1_OTAR0	(OVC1_BLK0_OTAR)

/** \brief  10, Redirected Address Base Register */
#define OVC1_BLK0_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB10u)

/** Alias (User Manual Name) for OVC1_BLK0_RABR.
* To use register names with standard convension, please use OVC1_BLK0_RABR.
*/
#define	OVC1_RABR0	(OVC1_BLK0_RABR)

/** \brief  90, Overlay Mask Register */
#define OVC1_BLK10_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB90u)

/** Alias (User Manual Name) for OVC1_BLK10_OMASK.
* To use register names with standard convension, please use OVC1_BLK10_OMASK.
*/
#define	OVC1_OMASK10	(OVC1_BLK10_OMASK)

/** \brief  8C, Overlay Target Address Register */
#define OVC1_BLK10_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB8Cu)

/** Alias (User Manual Name) for OVC1_BLK10_OTAR.
* To use register names with standard convension, please use OVC1_BLK10_OTAR.
*/
#define	OVC1_OTAR10	(OVC1_BLK10_OTAR)

/** \brief  88, Redirected Address Base Register */
#define OVC1_BLK10_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB88u)

