luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC1_BLK10_RABR.
* To use register names with standard convension, please use OVC1_BLK10_RABR.
*/
#define	OVC1_RABR10	(OVC1_BLK10_RABR)

/** \brief  9C, Overlay Mask Register */
#define OVC1_BLK11_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB9Cu)

/** Alias (User Manual Name) for OVC1_BLK11_OMASK.
* To use register names with standard convension, please use OVC1_BLK11_OMASK.
*/
#define	OVC1_OMASK11	(OVC1_BLK11_OMASK)

/** \brief  98, Overlay Target Address Register */
#define OVC1_BLK11_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB98u)

/** Alias (User Manual Name) for OVC1_BLK11_OTAR.
* To use register names with standard convension, please use OVC1_BLK11_OTAR.
*/
#define	OVC1_OTAR11	(OVC1_BLK11_OTAR)

/** \brief  94, Redirected Address Base Register */
#define OVC1_BLK11_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB94u)

/** Alias (User Manual Name) for OVC1_BLK11_RABR.
* To use register names with standard convension, please use OVC1_BLK11_RABR.
*/
#define	OVC1_RABR11	(OVC1_BLK11_RABR)

/** \brief  A8, Overlay Mask Register */
#define OVC1_BLK12_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FBA8u)

/** Alias (User Manual Name) for OVC1_BLK12_OMASK.
* To use register names with standard convension, please use OVC1_BLK12_OMASK.
*/
#define	OVC1_OMASK12	(OVC1_BLK12_OMASK)

/** \brief  A4, Overlay Target Address Register */
#define OVC1_BLK12_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FBA4u)

/** Alias (User Manual Name) for OVC1_BLK12_OTAR.
* To use register names with standard convension, please use OVC1_BLK12_OTAR.
*/
#define	OVC1_OTAR12	(OVC1_BLK12_OTAR)

/** \brief  A0, Redirected Address Base Register */
#define OVC1_BLK12_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FBA0u)

/** Alias (User Manual Name) for OVC1_BLK12_RABR.
* To use register names with standard convension, please use OVC1_BLK12_RABR.
*/
#define	OVC1_RABR12	(OVC1_BLK12_RABR)

/** \brief  B4, Overlay Mask Register */
#define OVC1_BLK13_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FBB4u)

/** Alias (User Manual Name) for OVC1_BLK13_OMASK.
* To use register names with standard convension, please use OVC1_BLK13_OMASK.
*/
#define	OVC1_OMASK13	(OVC1_BLK13_OMASK)

/** \brief  B0, Overlay Target Address Register */
#define OVC1_BLK13_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FBB0u)

/** Alias (User Manual Name) for OVC1_BLK13_OTAR.
* To use register names with standard convension, please use OVC1_BLK13_OTAR.
*/
#define	OVC1_OTAR13	(OVC1_BLK13_OTAR)

/** \brief  AC, Redirected Address Base Register */
#define OVC1_BLK13_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FBACu)

/** Alias (User Manual Name) for OVC1_BLK13_RABR.
* To use register names with standard convension, please use OVC1_BLK13_RABR.
*/
#define	OVC1_RABR13	(OVC1_BLK13_RABR)

/** \brief  C0, Overlay Mask Register */
#define OVC1_BLK14_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FBC0u)

/** Alias (User Manual Name) for OVC1_BLK14_OMASK.
* To use register names with standard convension, please use OVC1_BLK14_OMASK.
*/
#define	OVC1_OMASK14	(OVC1_BLK14_OMASK)

/** \brief  BC, Overlay Target Address Register */
#define OVC1_BLK14_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FBBCu)

/** Alias (User Manual Name) for OVC1_BLK14_OTAR.
* To use register names with standard convension, please use OVC1_BLK14_OTAR.
*/
#define	OVC1_OTAR14	(OVC1_BLK14_OTAR)

/** \brief  B8, Redirected Address Base Register */
#define OVC1_BLK14_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FBB8u)

/** Alias (User Manual Name) for OVC1_BLK14_RABR.
* To use register names with standard convension, please use OVC1_BLK14_RABR.
*/
#define	OVC1_RABR14	(OVC1_BLK14_RABR)

/** \brief  CC, Overlay Mask Register */
#define OVC1_BLK15_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FBCCu)

/** Alias (User Manual Name) for OVC1_BLK15_OMASK.
* To use register names with standard convension, please use OVC1_BLK15_OMASK.
*/
#define	OVC1_OMASK15	(OVC1_BLK15_OMASK)

/** \brief  C8, Overlay Target Address Register */
#define OVC1_BLK15_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FBC8u)

/** Alias (User Manual Name) for OVC1_BLK15_OTAR.
* To use register names with standard convension, please use OVC1_BLK15_OTAR.
*/
#define	OVC1_OTAR15	(OVC1_BLK15_OTAR)

/** \brief  C4, Redirected Address Base Register */
#define OVC1_BLK15_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FBC4u)

/** Alias (User Manual Name) for OVC1_BLK15_RABR.
* To use register names with standard convension, please use OVC1_BLK15_RABR.
*/
#define	OVC1_RABR15	(OVC1_BLK15_RABR)

/** \brief  D8, Overlay Mask Register */
#define OVC1_BLK16_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FBD8u)

/** Alias (User Manual Name) for OVC1_BLK16_OMASK.
* To use register names with standard convension, please use OVC1_BLK16_OMASK.
*/
#define	OVC1_OMASK16	(OVC1_BLK16_OMASK)

/** \brief  D4, Overlay Target Address Register */
#define OVC1_BLK16_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FBD4u)

/** Alias (User Manual Name) for OVC1_BLK16_OTAR.
* To use register names with standard convension, please use OVC1_BLK16_OTAR.
*/
#define	OVC1_OTAR16	(OVC1_BLK16_OTAR)

/** \brief  D0, Redirected Address Base Register */
#define OVC1_BLK16_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FBD0u)

/** Alias (User Manual Name) for OVC1_BLK16_RABR.
* To use register names with standard convension, please use OVC1_BLK16_RABR.
*/
#define	OVC1_RABR16	(OVC1_BLK16_RABR)

/** \brief  E4, Overlay Mask Register */
#define OVC1_BLK17_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FBE4u)

/** Alias (User Manual Name) for OVC1_BLK17_OMASK.
* To use register names with standard convension, please use OVC1_BLK17_OMASK.
*/
#define	OVC1_OMASK17	(OVC1_BLK17_OMASK)

/** \brief  E0, Overlay Target Address Register */
#define OVC1_BLK17_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FBE0u)

/** Alias (User Manual Name) for OVC1_BLK17_OTAR.
* To use register names with standard convension, please use OVC1_BLK17_OTAR.
*/
#define	OVC1_OTAR17	(OVC1_BLK17_OTAR)

/** \brief  DC, Redirected Address Base Register */
#define OVC1_BLK17_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FBDCu)

/** Alias (User Manual Name) for OVC1_BLK17_RABR.
* To use register names with standard convension, please use OVC1_BLK17_RABR.
*/
#define	OVC1_RABR17	(OVC1_BLK17_RABR)

/** \brief  F0, Overlay Mask Register */
#define OVC1_BLK18_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FBF0u)

