luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC1_BLK18_OMASK.
* To use register names with standard convension, please use OVC1_BLK18_OMASK.
*/
#define	OVC1_OMASK18	(OVC1_BLK18_OMASK)

/** \brief  EC, Overlay Target Address Register */
#define OVC1_BLK18_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FBECu)

/** Alias (User Manual Name) for OVC1_BLK18_OTAR.
* To use register names with standard convension, please use OVC1_BLK18_OTAR.
*/
#define	OVC1_OTAR18	(OVC1_BLK18_OTAR)

/** \brief  E8, Redirected Address Base Register */
#define OVC1_BLK18_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FBE8u)

/** Alias (User Manual Name) for OVC1_BLK18_RABR.
* To use register names with standard convension, please use OVC1_BLK18_RABR.
*/
#define	OVC1_RABR18	(OVC1_BLK18_RABR)

/** \brief  FC, Overlay Mask Register */
#define OVC1_BLK19_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FBFCu)

/** Alias (User Manual Name) for OVC1_BLK19_OMASK.
* To use register names with standard convension, please use OVC1_BLK19_OMASK.
*/
#define	OVC1_OMASK19	(OVC1_BLK19_OMASK)

/** \brief  F8, Overlay Target Address Register */
#define OVC1_BLK19_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FBF8u)

/** Alias (User Manual Name) for OVC1_BLK19_OTAR.
* To use register names with standard convension, please use OVC1_BLK19_OTAR.
*/
#define	OVC1_OTAR19	(OVC1_BLK19_OTAR)

/** \brief  F4, Redirected Address Base Register */
#define OVC1_BLK19_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FBF4u)

/** Alias (User Manual Name) for OVC1_BLK19_RABR.
* To use register names with standard convension, please use OVC1_BLK19_RABR.
*/
#define	OVC1_RABR19	(OVC1_BLK19_RABR)

/** \brief  24, Overlay Mask Register */
#define OVC1_BLK1_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB24u)

/** Alias (User Manual Name) for OVC1_BLK1_OMASK.
* To use register names with standard convension, please use OVC1_BLK1_OMASK.
*/
#define	OVC1_OMASK1	(OVC1_BLK1_OMASK)

/** \brief  20, Overlay Target Address Register */
#define OVC1_BLK1_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB20u)

/** Alias (User Manual Name) for OVC1_BLK1_OTAR.
* To use register names with standard convension, please use OVC1_BLK1_OTAR.
*/
#define	OVC1_OTAR1	(OVC1_BLK1_OTAR)

/** \brief  1C, Redirected Address Base Register */
#define OVC1_BLK1_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB1Cu)

/** Alias (User Manual Name) for OVC1_BLK1_RABR.
* To use register names with standard convension, please use OVC1_BLK1_RABR.
*/
#define	OVC1_RABR1	(OVC1_BLK1_RABR)

/** \brief  108, Overlay Mask Register */
#define OVC1_BLK20_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC08u)

/** Alias (User Manual Name) for OVC1_BLK20_OMASK.
* To use register names with standard convension, please use OVC1_BLK20_OMASK.
*/
#define	OVC1_OMASK20	(OVC1_BLK20_OMASK)

/** \brief  104, Overlay Target Address Register */
#define OVC1_BLK20_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC04u)

/** Alias (User Manual Name) for OVC1_BLK20_OTAR.
* To use register names with standard convension, please use OVC1_BLK20_OTAR.
*/
#define	OVC1_OTAR20	(OVC1_BLK20_OTAR)

/** \brief  100, Redirected Address Base Register */
#define OVC1_BLK20_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC00u)

/** Alias (User Manual Name) for OVC1_BLK20_RABR.
* To use register names with standard convension, please use OVC1_BLK20_RABR.
*/
#define	OVC1_RABR20	(OVC1_BLK20_RABR)

/** \brief  114, Overlay Mask Register */
#define OVC1_BLK21_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC14u)

/** Alias (User Manual Name) for OVC1_BLK21_OMASK.
* To use register names with standard convension, please use OVC1_BLK21_OMASK.
*/
#define	OVC1_OMASK21	(OVC1_BLK21_OMASK)

/** \brief  110, Overlay Target Address Register */
#define OVC1_BLK21_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC10u)

/** Alias (User Manual Name) for OVC1_BLK21_OTAR.
* To use register names with standard convension, please use OVC1_BLK21_OTAR.
*/
#define	OVC1_OTAR21	(OVC1_BLK21_OTAR)

/** \brief  10C, Redirected Address Base Register */
#define OVC1_BLK21_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC0Cu)

/** Alias (User Manual Name) for OVC1_BLK21_RABR.
* To use register names with standard convension, please use OVC1_BLK21_RABR.
*/
#define	OVC1_RABR21	(OVC1_BLK21_RABR)

/** \brief  120, Overlay Mask Register */
#define OVC1_BLK22_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC20u)

/** Alias (User Manual Name) for OVC1_BLK22_OMASK.
* To use register names with standard convension, please use OVC1_BLK22_OMASK.
*/
#define	OVC1_OMASK22	(OVC1_BLK22_OMASK)

/** \brief  11C, Overlay Target Address Register */
#define OVC1_BLK22_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC1Cu)

/** Alias (User Manual Name) for OVC1_BLK22_OTAR.
* To use register names with standard convension, please use OVC1_BLK22_OTAR.
*/
#define	OVC1_OTAR22	(OVC1_BLK22_OTAR)

/** \brief  118, Redirected Address Base Register */
#define OVC1_BLK22_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC18u)

/** Alias (User Manual Name) for OVC1_BLK22_RABR.
* To use register names with standard convension, please use OVC1_BLK22_RABR.
*/
#define	OVC1_RABR22	(OVC1_BLK22_RABR)

/** \brief  12C, Overlay Mask Register */
#define OVC1_BLK23_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC2Cu)

/** Alias (User Manual Name) for OVC1_BLK23_OMASK.
* To use register names with standard convension, please use OVC1_BLK23_OMASK.
*/
#define	OVC1_OMASK23	(OVC1_BLK23_OMASK)

/** \brief  128, Overlay Target Address Register */
#define OVC1_BLK23_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC28u)

/** Alias (User Manual Name) for OVC1_BLK23_OTAR.
* To use register names with standard convension, please use OVC1_BLK23_OTAR.
*/
#define	OVC1_OTAR23	(OVC1_BLK23_OTAR)

/** \brief  124, Redirected Address Base Register */
#define OVC1_BLK23_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC24u)

/** Alias (User Manual Name) for OVC1_BLK23_RABR.
* To use register names with standard convension, please use OVC1_BLK23_RABR.
*/
#define	OVC1_RABR23	(OVC1_BLK23_RABR)

/** \brief  138, Overlay Mask Register */
#define OVC1_BLK24_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC38u)

/** Alias (User Manual Name) for OVC1_BLK24_OMASK.
* To use register names with standard convension, please use OVC1_BLK24_OMASK.
*/
#define	OVC1_OMASK24	(OVC1_BLK24_OMASK)

/** \brief  134, Overlay Target Address Register */
#define OVC1_BLK24_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC34u)

/** Alias (User Manual Name) for OVC1_BLK24_OTAR.
* To use register names with standard convension, please use OVC1_BLK24_OTAR.
*/
#define	OVC1_OTAR24	(OVC1_BLK24_OTAR)

