luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxOvc_reg.h
/** \brief  130, Redirected Address Base Register */
#define OVC1_BLK24_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC30u)

/** Alias (User Manual Name) for OVC1_BLK24_RABR.
* To use register names with standard convension, please use OVC1_BLK24_RABR.
*/
#define	OVC1_RABR24	(OVC1_BLK24_RABR)

/** \brief  144, Overlay Mask Register */
#define OVC1_BLK25_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC44u)

/** Alias (User Manual Name) for OVC1_BLK25_OMASK.
* To use register names with standard convension, please use OVC1_BLK25_OMASK.
*/
#define	OVC1_OMASK25	(OVC1_BLK25_OMASK)

/** \brief  140, Overlay Target Address Register */
#define OVC1_BLK25_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC40u)

/** Alias (User Manual Name) for OVC1_BLK25_OTAR.
* To use register names with standard convension, please use OVC1_BLK25_OTAR.
*/
#define	OVC1_OTAR25	(OVC1_BLK25_OTAR)

/** \brief  13C, Redirected Address Base Register */
#define OVC1_BLK25_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC3Cu)

/** Alias (User Manual Name) for OVC1_BLK25_RABR.
* To use register names with standard convension, please use OVC1_BLK25_RABR.
*/
#define	OVC1_RABR25	(OVC1_BLK25_RABR)

/** \brief  150, Overlay Mask Register */
#define OVC1_BLK26_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC50u)

/** Alias (User Manual Name) for OVC1_BLK26_OMASK.
* To use register names with standard convension, please use OVC1_BLK26_OMASK.
*/
#define	OVC1_OMASK26	(OVC1_BLK26_OMASK)

/** \brief  14C, Overlay Target Address Register */
#define OVC1_BLK26_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC4Cu)

/** Alias (User Manual Name) for OVC1_BLK26_OTAR.
* To use register names with standard convension, please use OVC1_BLK26_OTAR.
*/
#define	OVC1_OTAR26	(OVC1_BLK26_OTAR)

/** \brief  148, Redirected Address Base Register */
#define OVC1_BLK26_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC48u)

/** Alias (User Manual Name) for OVC1_BLK26_RABR.
* To use register names with standard convension, please use OVC1_BLK26_RABR.
*/
#define	OVC1_RABR26	(OVC1_BLK26_RABR)

/** \brief  15C, Overlay Mask Register */
#define OVC1_BLK27_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC5Cu)

/** Alias (User Manual Name) for OVC1_BLK27_OMASK.
* To use register names with standard convension, please use OVC1_BLK27_OMASK.
*/
#define	OVC1_OMASK27	(OVC1_BLK27_OMASK)

/** \brief  158, Overlay Target Address Register */
#define OVC1_BLK27_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC58u)

/** Alias (User Manual Name) for OVC1_BLK27_OTAR.
* To use register names with standard convension, please use OVC1_BLK27_OTAR.
*/
#define	OVC1_OTAR27	(OVC1_BLK27_OTAR)

/** \brief  154, Redirected Address Base Register */
#define OVC1_BLK27_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC54u)

/** Alias (User Manual Name) for OVC1_BLK27_RABR.
* To use register names with standard convension, please use OVC1_BLK27_RABR.
*/
#define	OVC1_RABR27	(OVC1_BLK27_RABR)

/** \brief  168, Overlay Mask Register */
#define OVC1_BLK28_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC68u)

/** Alias (User Manual Name) for OVC1_BLK28_OMASK.
* To use register names with standard convension, please use OVC1_BLK28_OMASK.
*/
#define	OVC1_OMASK28	(OVC1_BLK28_OMASK)

/** \brief  164, Overlay Target Address Register */
#define OVC1_BLK28_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC64u)

/** Alias (User Manual Name) for OVC1_BLK28_OTAR.
* To use register names with standard convension, please use OVC1_BLK28_OTAR.
*/
#define	OVC1_OTAR28	(OVC1_BLK28_OTAR)

/** \brief  160, Redirected Address Base Register */
#define OVC1_BLK28_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC60u)

/** Alias (User Manual Name) for OVC1_BLK28_RABR.
* To use register names with standard convension, please use OVC1_BLK28_RABR.
*/
#define	OVC1_RABR28	(OVC1_BLK28_RABR)

/** \brief  174, Overlay Mask Register */
#define OVC1_BLK29_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC74u)

/** Alias (User Manual Name) for OVC1_BLK29_OMASK.
* To use register names with standard convension, please use OVC1_BLK29_OMASK.
*/
#define	OVC1_OMASK29	(OVC1_BLK29_OMASK)

/** \brief  170, Overlay Target Address Register */
#define OVC1_BLK29_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC70u)

/** Alias (User Manual Name) for OVC1_BLK29_OTAR.
* To use register names with standard convension, please use OVC1_BLK29_OTAR.
*/
#define	OVC1_OTAR29	(OVC1_BLK29_OTAR)

/** \brief  16C, Redirected Address Base Register */
#define OVC1_BLK29_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC6Cu)

/** Alias (User Manual Name) for OVC1_BLK29_RABR.
* To use register names with standard convension, please use OVC1_BLK29_RABR.
*/
#define	OVC1_RABR29	(OVC1_BLK29_RABR)

/** \brief  30, Overlay Mask Register */
#define OVC1_BLK2_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB30u)

/** Alias (User Manual Name) for OVC1_BLK2_OMASK.
* To use register names with standard convension, please use OVC1_BLK2_OMASK.
*/
#define	OVC1_OMASK2	(OVC1_BLK2_OMASK)

/** \brief  2C, Overlay Target Address Register */
#define OVC1_BLK2_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB2Cu)

/** Alias (User Manual Name) for OVC1_BLK2_OTAR.
* To use register names with standard convension, please use OVC1_BLK2_OTAR.
*/
#define	OVC1_OTAR2	(OVC1_BLK2_OTAR)

/** \brief  28, Redirected Address Base Register */
#define OVC1_BLK2_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB28u)

/** Alias (User Manual Name) for OVC1_BLK2_RABR.
* To use register names with standard convension, please use OVC1_BLK2_RABR.
*/
#define	OVC1_RABR2	(OVC1_BLK2_RABR)

/** \brief  180, Overlay Mask Register */
#define OVC1_BLK30_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC80u)

/** Alias (User Manual Name) for OVC1_BLK30_OMASK.
* To use register names with standard convension, please use OVC1_BLK30_OMASK.
*/
#define	OVC1_OMASK30	(OVC1_BLK30_OMASK)

/** \brief  17C, Overlay Target Address Register */
#define OVC1_BLK30_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC7Cu)

/** Alias (User Manual Name) for OVC1_BLK30_OTAR.
* To use register names with standard convension, please use OVC1_BLK30_OTAR.
*/
#define	OVC1_OTAR30	(OVC1_BLK30_OTAR)

/** \brief  178, Redirected Address Base Register */
#define OVC1_BLK30_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC78u)

/** Alias (User Manual Name) for OVC1_BLK30_RABR.
* To use register names with standard convension, please use OVC1_BLK30_RABR.
*/
#define	OVC1_RABR30	(OVC1_BLK30_RABR)

/** \brief  18C, Overlay Mask Register */
#define OVC1_BLK31_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC8Cu)

/** Alias (User Manual Name) for OVC1_BLK31_OMASK.
* To use register names with standard convension, please use OVC1_BLK31_OMASK.
*/
#define	OVC1_OMASK31	(OVC1_BLK31_OMASK)

/** \brief  188, Overlay Target Address Register */
#define OVC1_BLK31_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC88u)

/** Alias (User Manual Name) for OVC1_BLK31_OTAR.
* To use register names with standard convension, please use OVC1_BLK31_OTAR.
*/
#define	OVC1_OTAR31	(OVC1_BLK31_OTAR)

/** \brief  184, Redirected Address Base Register */
#define OVC1_BLK31_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC84u)

/** Alias (User Manual Name) for OVC1_BLK31_RABR.
* To use register names with standard convension, please use OVC1_BLK31_RABR.
*/
#define	OVC1_RABR31	(OVC1_BLK31_RABR)

/** \brief  3C, Overlay Mask Register */
#define OVC1_BLK3_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB3Cu)

/** Alias (User Manual Name) for OVC1_BLK3_OMASK.
* To use register names with standard convension, please use OVC1_BLK3_OMASK.
*/
#define	OVC1_OMASK3	(OVC1_BLK3_OMASK)

/** \brief  38, Overlay Target Address Register */
#define OVC1_BLK3_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB38u)

