luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC2_BLK2_OTAR.
* To use register names with standard convension, please use OVC2_BLK2_OTAR.
*/
#define	OVC2_OTAR2	(OVC2_BLK2_OTAR)

/** \brief  28, Redirected Address Base Register */
#define OVC2_BLK2_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB28u)

/** Alias (User Manual Name) for OVC2_BLK2_RABR.
* To use register names with standard convension, please use OVC2_BLK2_RABR.
*/
#define	OVC2_RABR2	(OVC2_BLK2_RABR)

/** \brief  180, Overlay Mask Register */
#define OVC2_BLK30_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC80u)

/** Alias (User Manual Name) for OVC2_BLK30_OMASK.
* To use register names with standard convension, please use OVC2_BLK30_OMASK.
*/
#define	OVC2_OMASK30	(OVC2_BLK30_OMASK)

/** \brief  17C, Overlay Target Address Register */
#define OVC2_BLK30_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC7Cu)

/** Alias (User Manual Name) for OVC2_BLK30_OTAR.
* To use register names with standard convension, please use OVC2_BLK30_OTAR.
*/
#define	OVC2_OTAR30	(OVC2_BLK30_OTAR)

/** \brief  178, Redirected Address Base Register */
#define OVC2_BLK30_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC78u)

/** Alias (User Manual Name) for OVC2_BLK30_RABR.
* To use register names with standard convension, please use OVC2_BLK30_RABR.
*/
#define	OVC2_RABR30	(OVC2_BLK30_RABR)

/** \brief  18C, Overlay Mask Register */
#define OVC2_BLK31_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC8Cu)

/** Alias (User Manual Name) for OVC2_BLK31_OMASK.
* To use register names with standard convension, please use OVC2_BLK31_OMASK.
*/
#define	OVC2_OMASK31	(OVC2_BLK31_OMASK)

/** \brief  188, Overlay Target Address Register */
#define OVC2_BLK31_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC88u)

/** Alias (User Manual Name) for OVC2_BLK31_OTAR.
* To use register names with standard convension, please use OVC2_BLK31_OTAR.
*/
#define	OVC2_OTAR31	(OVC2_BLK31_OTAR)

/** \brief  184, Redirected Address Base Register */
#define OVC2_BLK31_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC84u)

/** Alias (User Manual Name) for OVC2_BLK31_RABR.
* To use register names with standard convension, please use OVC2_BLK31_RABR.
*/
#define	OVC2_RABR31	(OVC2_BLK31_RABR)

/** \brief  3C, Overlay Mask Register */
#define OVC2_BLK3_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB3Cu)

/** Alias (User Manual Name) for OVC2_BLK3_OMASK.
* To use register names with standard convension, please use OVC2_BLK3_OMASK.
*/
#define	OVC2_OMASK3	(OVC2_BLK3_OMASK)

/** \brief  38, Overlay Target Address Register */
#define OVC2_BLK3_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB38u)

/** Alias (User Manual Name) for OVC2_BLK3_OTAR.
* To use register names with standard convension, please use OVC2_BLK3_OTAR.
*/
#define	OVC2_OTAR3	(OVC2_BLK3_OTAR)

/** \brief  34, Redirected Address Base Register */
#define OVC2_BLK3_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB34u)

/** Alias (User Manual Name) for OVC2_BLK3_RABR.
* To use register names with standard convension, please use OVC2_BLK3_RABR.
*/
#define	OVC2_RABR3	(OVC2_BLK3_RABR)

/** \brief  48, Overlay Mask Register */
#define OVC2_BLK4_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB48u)

/** Alias (User Manual Name) for OVC2_BLK4_OMASK.
* To use register names with standard convension, please use OVC2_BLK4_OMASK.
*/
#define	OVC2_OMASK4	(OVC2_BLK4_OMASK)

/** \brief  44, Overlay Target Address Register */
#define OVC2_BLK4_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB44u)

/** Alias (User Manual Name) for OVC2_BLK4_OTAR.
* To use register names with standard convension, please use OVC2_BLK4_OTAR.
*/
#define	OVC2_OTAR4	(OVC2_BLK4_OTAR)

/** \brief  40, Redirected Address Base Register */
#define OVC2_BLK4_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB40u)

/** Alias (User Manual Name) for OVC2_BLK4_RABR.
* To use register names with standard convension, please use OVC2_BLK4_RABR.
*/
#define	OVC2_RABR4	(OVC2_BLK4_RABR)

/** \brief  54, Overlay Mask Register */
#define OVC2_BLK5_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB54u)

/** Alias (User Manual Name) for OVC2_BLK5_OMASK.
* To use register names with standard convension, please use OVC2_BLK5_OMASK.
*/
#define	OVC2_OMASK5	(OVC2_BLK5_OMASK)

/** \brief  50, Overlay Target Address Register */
#define OVC2_BLK5_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB50u)

/** Alias (User Manual Name) for OVC2_BLK5_OTAR.
* To use register names with standard convension, please use OVC2_BLK5_OTAR.
*/
#define	OVC2_OTAR5	(OVC2_BLK5_OTAR)

/** \brief  4C, Redirected Address Base Register */
#define OVC2_BLK5_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB4Cu)

/** Alias (User Manual Name) for OVC2_BLK5_RABR.
* To use register names with standard convension, please use OVC2_BLK5_RABR.
*/
#define	OVC2_RABR5	(OVC2_BLK5_RABR)

/** \brief  60, Overlay Mask Register */
#define OVC2_BLK6_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB60u)

/** Alias (User Manual Name) for OVC2_BLK6_OMASK.
* To use register names with standard convension, please use OVC2_BLK6_OMASK.
*/
#define	OVC2_OMASK6	(OVC2_BLK6_OMASK)

/** \brief  5C, Overlay Target Address Register */
#define OVC2_BLK6_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB5Cu)

/** Alias (User Manual Name) for OVC2_BLK6_OTAR.
* To use register names with standard convension, please use OVC2_BLK6_OTAR.
*/
#define	OVC2_OTAR6	(OVC2_BLK6_OTAR)

/** \brief  58, Redirected Address Base Register */
#define OVC2_BLK6_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB58u)

/** Alias (User Manual Name) for OVC2_BLK6_RABR.
* To use register names with standard convension, please use OVC2_BLK6_RABR.
*/
#define	OVC2_RABR6	(OVC2_BLK6_RABR)

/** \brief  6C, Overlay Mask Register */
#define OVC2_BLK7_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB6Cu)

/** Alias (User Manual Name) for OVC2_BLK7_OMASK.
* To use register names with standard convension, please use OVC2_BLK7_OMASK.
*/
#define	OVC2_OMASK7	(OVC2_BLK7_OMASK)

/** \brief  68, Overlay Target Address Register */
#define OVC2_BLK7_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB68u)

/** Alias (User Manual Name) for OVC2_BLK7_OTAR.
* To use register names with standard convension, please use OVC2_BLK7_OTAR.
*/
#define	OVC2_OTAR7	(OVC2_BLK7_OTAR)

