luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxOvc_reg.h
/** \brief  64, Redirected Address Base Register */
#define OVC2_BLK7_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB64u)

/** Alias (User Manual Name) for OVC2_BLK7_RABR.
* To use register names with standard convension, please use OVC2_BLK7_RABR.
*/
#define	OVC2_RABR7	(OVC2_BLK7_RABR)

/** \brief  78, Overlay Mask Register */
#define OVC2_BLK8_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB78u)

/** Alias (User Manual Name) for OVC2_BLK8_OMASK.
* To use register names with standard convension, please use OVC2_BLK8_OMASK.
*/
#define	OVC2_OMASK8	(OVC2_BLK8_OMASK)

/** \brief  74, Overlay Target Address Register */
#define OVC2_BLK8_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB74u)

/** Alias (User Manual Name) for OVC2_BLK8_OTAR.
* To use register names with standard convension, please use OVC2_BLK8_OTAR.
*/
#define	OVC2_OTAR8	(OVC2_BLK8_OTAR)

/** \brief  70, Redirected Address Base Register */
#define OVC2_BLK8_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB70u)

/** Alias (User Manual Name) for OVC2_BLK8_RABR.
* To use register names with standard convension, please use OVC2_BLK8_RABR.
*/
#define	OVC2_RABR8	(OVC2_BLK8_RABR)

/** \brief  84, Overlay Mask Register */
#define OVC2_BLK9_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB84u)

/** Alias (User Manual Name) for OVC2_BLK9_OMASK.
* To use register names with standard convension, please use OVC2_BLK9_OMASK.
*/
#define	OVC2_OMASK9	(OVC2_BLK9_OMASK)

/** \brief  80, Overlay Target Address Register */
#define OVC2_BLK9_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB80u)

/** Alias (User Manual Name) for OVC2_BLK9_OTAR.
* To use register names with standard convension, please use OVC2_BLK9_OTAR.
*/
#define	OVC2_OTAR9	(OVC2_BLK9_OTAR)

/** \brief  7C, Redirected Address Base Register */
#define OVC2_BLK9_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB7Cu)

/** Alias (User Manual Name) for OVC2_BLK9_RABR.
* To use register names with standard convension, please use OVC2_BLK9_RABR.
*/
#define	OVC2_RABR9	(OVC2_BLK9_RABR)

/** \brief  0, Overlay Range Select Register */
#define OVC2_OSEL /*lint --e(923)*/ (*(volatile Ifx_OVC_OSEL*)0xF884FB00u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXOVC_REG_H */
